Tekla Open API Reference for Tekla Structures 2025
StructuresExtender Methods
The StructuresExtender type exposes the following members.
Methods
Name | Description
CanExtend
 Specifies whether the current object can provide its extender properties to the specified object.
GetAttributeName
 Retrieves the AttributeName text associated with the specified control.
GetAttributeTypeName
 Retrieves the AttributeTypeName text associated with the specified control.
GetBindPropertyName
 Retrieves the BindPropertyName text associated with the specified control.
GetIsFilter
 Retrieves the IsFilter boolean value associated with the specified control.
SetAttributeName
 Associates AttributeName text with the specified control.
SetAttributeTypeName
 Associates the AttributeTypeName text with the specified control.
SetBindPropertyName
 Associates the BindPropertyName text with the specified control.
SetIsFilter
 Associates the IsFilter boolean value with the specified control.
Top
See Also
Reference
StructuresExtender Class
Tekla.Structures.Dialog Namespace